//var ajaxUrlPort = '127.0.0.1:81'; //桌機 
var ajaxUrlPort = '10.55.52.98:34084'; //hpc
// Themes begin
am4core.useTheme(am4themes_spiritedaway);
am4core.useTheme(am4themes_animated);
// Themes end

$(document).ready(function() {
	var chart = am4core.create("chartdiv_21", am4plugins_wordCloud.WordCloud);
	var series = chart.series.push(new am4plugins_wordCloud.WordCloudSeries());

    chart.logo.height = -150000; 
	series.accuracy = 4;
	series.step = 15;
	series.rotationThreshold = 0.7;
	series.maxCount = 200;
	series.minWordLength = 2;
	series.labels.template.margin(4,4,4,4);
	series.maxFontSize = am4core.percent(30); 
	
	series.data = [{'tag': '色域', 'count': 28}, {'tag': '黑屏', 'count': 181}, {'tag': '色偏', 'count': 28}, {'tag': '白斑', 'count': 42}, {'tag': '閃屏', 'count': 149}, {'tag': '漏光', 'count': 889}, {'tag': '點', 'count': 1563}, {'tag': '屏幕', 'count': 2581}, {'tag': '閃爍', 'count': 237}, {'tag': '豎紋', 'count': 10}, {'tag': '橫線', 'count': 16}, {'tag': '氣泡', 'count': 14}, {'tag': '花屏', 'count': 144}, {'tag': '重影', 'count': 83}, {'tag': '失靈', 'count': 85}, {'tag': '延遲', 'count': 38}, {'tag': '彩虹', 'count': 47}, {'tag': '偏色', 'count': 525}];
	
	series.dataFields.word = "tag";
	series.dataFields.value = "count";
	//series.text = "Though yet Though Though Though Though"; 
	series.colors = new am4core.ColorSet();
	series.colors.passOptions = {}; // makes it loop

	//series.labelsContainer.rotation = 45;
	series.angles = [0,-90];
	series.fontWeight = "700"
	series.labels.template.tooltipText = "{word}: {value}";
	
	var hoverState = series.labels.template.states.create("hover");
	hoverState.properties.fill = am4core.color("#FF0000");
	//setInterval(function () {
	//  series.dataItems.getIndex(Math.round(Math.random() * (series.dataItems.length - 1))).setValue("value", Math.round(Math.random() * 10));
	//}, 10000)
	series.labels.template.events.on("hit", function(ev) {
	  //console.log(ev.target.currentText);
	  //console.log(series);
	  //console.log(series.colors);
	  getUrlByKeywordHuaweiClub('Huawei',ev.target.currentText)
 	}, this);
	 
});

//function getUrlByKeyword(web,keyword){
function getUrlByKeywordHuaweiClub(company,keyword){
	$.ajax({
		url: "http://"+ajaxUrlPort+"/getUrlByKeywordHuaweiClub",
		type: "GET",
		dataType: 'json',
		data:{ keyword:keyword},
		contentType: "application/json; charset=utf-8",
		success: function (data) { 
			console.log(data) 
			resultTable = '<thead class="thead-dark"><tr><th scope="col">#</th><th scope="col">標題</th><th scope="col">關鍵字</th><th scope="col">發表日</th></tr></thead><tbody>';
			for(var i in data){
				//$("#resultTable").show(); 
  				id = data[i]['id']
				url = data[i]['url']
				title2 = data[i]['title2']
				publishdate = data[i]['publishdate']			
				keywordlistTmp = data[i]['keywordlist'].split(' ');
				keywordlist = '';
				for(k = 0 ; k < keywordlistTmp.length ; k ++){
					keywordlist = keywordlist+ (k+1)+'.'+keywordlistTmp[k]+' ';
				}
				resultTable = resultTable + '<tr><th scope="row">'+(parseInt(i)+1)+'</th><td><a href="'+url+'" target="_blank">'+title2+'</a></td><td>'+keywordlist+'</td><td>'+publishdate+'</td></tr>';
			}
			resultTable = resultTable + '</tbody>';
			$("#resultTable").html(resultTable);
		},				
		error: function(xhr) {
		  alert('Ajax getUrlByKeyword 發生錯誤:'+JSON.stringify(xhr)); 
		}
	});	

}



am4core.ready(function() { 
	// Themes begin
	am4core.useTheme(am4themes_animated);
	// Themes end

	// Create chart instance
	var chart = am4core.create("chartdiv_22", am4charts.XYChart);
    chart.logo.height = -150000; 
	// Add data
	//chart.data = [{'word': '色域', '202003': 9, '202004': 8, '202005': 10, '202006': 2}, {'word': '黑屏', '202003': 58, '202004': 30, '202005': 44, '202006': 48}, {'word': '色偏', '202003': 3, '202004': 24, '202005': 29, '202006': 7}, {'word': '白斑', '202003': 12, '202004': 6, '202005': 21, '202006': 3}, {'word': '閃屏', '202003': 0, '202004': 0, '202005': 1, '202006': 0}, {'word': '漏光', '202003': 169, '202004': 298, '202005': 174, '202006': 176}, {'word': '點', '202003': 1, '202004': 0, '202005': 0, '202006': 0}, {'word': '屏幕', '202003': 405, '202004': 773, '202005': 1016, '202006': 331}, {'word': '花屏', '202003': 47, '202004': 35, '202005': 51, '202006': 12}, {'word': '重影', '202003': 6, '202004': 31, '202005': 41, '202006': 5}, {'word': '彩虹', '202003': 4, '202004': 18, '202005': 25, '202006': 0}, {'word': '偏色', '202003': 30, '202004': 217, '202005': 223, '202006': 55}];
    chart.data = [{'word': '色域', '202003': 9, '202004': 8, '202005': 10, '202006': 2}, {'word': '黑屏', '202003': 58, '202004': 30, '202005': 44, '202006': 48}, {'word': '色偏', '202003': 3, '202004': 24, '202005': 29, '202006': 7}, {'word': '白斑', '202003': 12, '202004': 6, '202005': 21, '202006': 3}, {'word': '闪屏', '202003': 20, '202004': 43, '202005': 74, '202006': 11}, {'word': '漏光', '202003': 169, '202004': 298, '202005': 174, '202006': 176}, {'word': '点', '202003': 246, '202004': 560, '202005': 804, '202006': 304}, {'word': '屏幕', '202003': 405, '202004': 773, '202005': 1015, '202006': 331}, {'word': '闪烁', '202003': 27, '202004': 91, '202005': 102, '202006': 17}, {'word': '竖纹', '202003': 1, '202004': 5, '202005': 4, '202006': 0}, {'word': '横线', '202003': 5, '202004': 8, '202005': 2, '202006': 1}, {'word': '气泡', '202003': 0, '202004': 4, '202005': 8, '202006': 2}, {'word': '花屏', '202003': 47, '202004': 35, '202005': 51, '202006': 12}, {'word': '重影', '202003': 6, '202004': 31, '202005': 41, '202006': 5}, {'word': '失灵', '202003': 10, '202004': 34, '202005': 34, '202006': 5}, {'word': '延迟', '202003': 8, '202004': 19, '202005': 10, '202006': 1}, {'word': '彩虹', '202003': 4, '202004': 18, '202005': 25, '202006': 0}, {'word': '偏色', '202003': 30, '202004': 217, '202005': 223, '202006': 55}]	// Create category axis
	var categoryAxis = chart.xAxes.push(new am4charts.CategoryAxis());
	categoryAxis.dataFields.category = "word";
	categoryAxis.renderer.opposite = false;
	categoryAxis.renderer.minGridDistance = 20;
	// Create value axis
	var valueAxis = chart.yAxes.push(new am4charts.ValueAxis());
	valueAxis.renderer.inversed = false;
	valueAxis.title.text = "關鍵字/各月 出現次數";
	valueAxis.renderer.minLabelPosition = 0.01;

	// Create series
	var series1 = chart.series.push(new am4charts.LineSeries());
	series1.stroke = am4core.color("#FF1493");
	series1.dataFields.valueY = "202003";
	series1.dataFields.categoryX = "word";
	series1.name = "202003";
	//series1.bullets.push(new am4charts.CircleBullet());
	series1.tooltipText = "{name} 關鍵字 {categoryX} 出現 {valueY}次";
	series1.tooltip.getFillFromObject = false;
	series1.tooltip.background.fill = am4core.color("#FF1493");
	series1.legendSettings.valueText = "{valueY}";
	series1.visible  = true;


	var series2 = chart.series.push(new am4charts.LineSeries());
	series2.stroke = am4core.color("#DAA520");
	series2.dataFields.valueY = "202004";
	series2.dataFields.categoryX = "word";
	series2.name = '202004';
	//series2.bullets.push(new am4charts.CircleBullet());
	series2.tooltipText = "{name} 關鍵字 {categoryX} 出現 {valueY}次";
	series2.tooltip.getFillFromObject = false;
	series2.tooltip.background.fill = am4core.color("#DAA520");
	series2.legendSettings.valueText = "{valueY}";


	var series3 = chart.series.push(new am4charts.LineSeries());
	series3.stroke = am4core.color("#0000FF");
	series3.dataFields.valueY = "202005";
	series3.dataFields.categoryX = "word";
	series3.name = '202005';
	//series3.bullets.push(new am4charts.CircleBullet());
	series3.tooltipText = "{name} 關鍵字 {categoryX} 出現 {valueY}次";
	series3.tooltip.getFillFromObject = false;
	series3.tooltip.background.fill = am4core.color("#0000FF");
	series3.legendSettings.valueText = "{valueY}";


	var series4 = chart.series.push(new am4charts.LineSeries());
	series4.stroke = am4core.color("#228B22");
	series4.dataFields.valueY = "202006";
	series4.dataFields.categoryX = "word";
	series4.name = '202006';
	//series4.bullets.push(new am4charts.CircleBullet());
	series4.tooltipText = "{name} 關鍵字 {categoryX} 出現 {valueY}次";
	series4.tooltip.getFillFromObject = false;
	series4.tooltip.background.fill = am4core.color("#228B22");
	series4.legendSettings.valueText = "{valueY}";

	// Add chart cursor
	chart.cursor = new am4charts.XYCursor();
	chart.cursor.behavior = "zoomY";

	let hs1 = series1.segments.template.states.create("hover")
	hs1.properties.strokeWidth = 1;
	series1.segments.template.strokeWidth = 1;

	let hs2 = series2.segments.template.states.create("hover")
	hs2.properties.strokeWidth = 5;
	series2.segments.template.strokeWidth = 1;

	let hs3 = series3.segments.template.states.create("hover")
	hs3.properties.strokeWidth = 5;
	series3.segments.template.strokeWidth = 1;

	let hs4 = series4.segments.template.states.create("hover")
	hs3.properties.strokeWidth = 5;
	series4.segments.template.strokeWidth = 1;

	chart.legend = new am4charts.Legend();
	chart.legend.itemContainers.template.events.on("over", function(event){
	  var segments = event.target.dataItem.dataContext.segments;
	  segments.each(function(segment){
		segment.isHover = true;
	  })
	})

	chart.legend.itemContainers.template.events.on("out", function(event){
	  var segments = event.target.dataItem.dataContext.segments;
	  segments.each(function(segment){
		segment.isHover = false;
	  })
	})

});  


am4core.ready(function() {
	// Themes begin
	am4core.useTheme(am4themes_animated);
	// Themes end

	// Create chart instance
	var chart = am4core.create("chartdiv_23", am4charts.XYChart);
	chart.logo.height = -15000; 
	// Add data
	chart.data = [{'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202003', '色域': 9, '黑屏': 58, '色偏': 3, '白斑': 12, '闪屏': 20, '漏光': 169, '点': 246, '屏幕': 405, '闪烁': 27, '竖纹': 1, '横线': 5, '气泡': 0, '花屏': 47, '重影': 6, '失灵': 10, '延迟': 8, '彩虹': 4, '偏色': 30}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202004', '色域': 8, '黑屏': 30, '色偏': 24, '白斑': 6, '闪屏': 43, '漏光': 298, '点': 560, '屏幕': 773, '闪烁': 91, '竖纹': 5, '横线': 8, '气泡': 4, '花屏': 35, '重影': 31, '失灵': 34, '延迟': 19, '彩虹': 18, '偏色': 217}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202005', '色域': 10, '黑屏': 44, '色偏': 29, '白斑': 21, '闪屏': 74, '漏光': 174, '点': 804, '屏幕': 1015, '闪烁': 102, '竖纹': 4, '横线': 2, '气泡': 8, '花屏': 51, '重影': 41, '失灵': 34, '延迟': 10, '彩虹': 25, '偏色': 223}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}, {'ym': '202006', '色域': 2, '黑屏': 48, '色偏': 7, '白斑': 3, '闪屏': 11, '漏光': 176, '点': 304, '屏幕': 331, '闪烁': 17, '竖纹': 0, '横线': 1, '气泡': 2, '花屏': 12, '重影': 5, '失灵': 5, '延迟': 1, '彩虹': 0, '偏色': 55}]

	// Create category axis
	var categoryAxis = chart.xAxes.push(new am4charts.CategoryAxis());
	categoryAxis.dataFields.category = "ym";
	categoryAxis.renderer.opposite = false;
	//categoryAxis.renderer.minGridDistance = 20;
	// Create value axis
	var valueAxis = chart.yAxes.push(new am4charts.ValueAxis());
	valueAxis.renderer.inversed = false;
	valueAxis.title.text = "關鍵字/各月 出現次數";
	valueAxis.renderer.minLabelPosition = 0.01;
	keywordlistALL = ['色域','黑屏','色偏','白斑','闪屏','漏光','点','屏幕','闪烁','竖纹','横线','气泡','花屏','重影','失灵','延迟','彩虹','偏色']
    //keywordlistALL = ['色域','黑屏','色偏','白斑','閃屏','漏光','點','屏幕','閃爍','豎紋','橫線','氣泡','花屏','重影','失靈','延遲','彩虹','偏色' ]
	
    series = []
	hs = []
    for(i = 0 ; i < keywordlistALL.length; i++){
		series[i] = chart.series.push(new am4charts.LineSeries());
		//series[i].stroke = am4core.color("#FF1493");
		series[i].dataFields.valueY = keywordlistALL[i];
		series[i].dataFields.categoryX = "ym";
		series[i].name = keywordlistALL[i]; 
		series[i].tooltipText = "{name} 關鍵字 {categoryX} 出現 {valueY}次";
		//series[i].tooltip.getFillFromObject = false;
		//series[i].tooltip.background.fill = am4core.color("#FF1493");
		series[i].legendSettings.valueText = "{valueY}";
		series[i].visible  = true;
		
		hs[i] = series[i].segments.template.states.create("hover")
		hs[i].properties.strokeWidth = 1;
		series[i].segments.template.strokeWidth = 1;
	}
	chart.cursor = new am4charts.XYCursor();
	chart.cursor.behavior = "zoomY";
	chart.legend = new am4charts.Legend();
	chart.legend.itemContainers.template.events.on("over", function(event){
	  var segments = event.target.dataItem.dataContext.segments;
	  segments.each(function(segment){
		segment.isHover = true;
	  })
	})

	chart.legend.itemContainers.template.events.on("out", function(event){
	  var segments = event.target.dataItem.dataContext.segments;
	  segments.each(function(segment){
		segment.isHover = false;
	  })
	})

});  